package Overloading;
/*
 * Overloading методов в Java - это возможность создания нескольких методов с одним и тем же именем,
 * Но различающихся по количеству аргументов и их типу.
 *
 * Основные условия для overloaded методов:
 * Имя метода должно быть одинаковым для всех перегруженных методов.
 * Список параметров должен быть различным для каждого перегруженного метода. Это может быть различным типом данных, количеством параметров или порядком параметров.
 * Возвращаемый тип метода может быть разным, но он не должен использоваться для различения перегруженных методов.
 * Методы могут быть перегружены внутри одного класса или между классами, связанными наследованием.
 * Методы могут иметь разные модификаторы доступа (public, protected, private, default), но они должны иметь одинаковое имя и параметры.
 */
public class Animal {
}
