package Overloading;

public class Main {
    /*
     * Приоритетсность overloaded методов:
     * Если при вызове метода его параметр лист соответствует нескольким параметрам overloaded методов
     * Тогда приоритет их вызовов будет выглядеть следующим образом:
     *
     * Точное совпадение типов данных.
     * Поглощающие типы данных (большие типы данных для primitive и parent классы для ссылочных типов)
     * Autoboxed типы данных
     * Varargs
     */
    public static void main(String[] args) {

    }
}
