package Collection;
/*
   LinkedList (двухсязный список) в Java представляет собой структуру данных, которая состоит из узлов,
   Связанных друг с другом в однонаправленную или двунаправленную последовательность.
   Каждый узел содержит данные и ссылку на следующий или предыдущий узел в списке.

   В целом, выбор между LinkedList и ArrayList зависит от конкретной задачи и требований к производительности.

   Когда использовать LinkedList:
   Необходимо много данных добавлять в начало списка
   Удалять с начала (index = 0) списка, т.е. элементы, которые были добавлены первыми.
   set в конце списка

   Когда использовать ArrayList
   get
   set (начало и середина)
   add
   remove ( кроме начала списка )
 */
public class _LinkedList {
}
