package Collection;
/*
 * LinkedList (двухсязный список) в Java представляет собой структуру данных, которая состоит из узлов,
 * Связанных друг с другом в однонаправленную или двунаправленную последовательность.
 * Каждый узел содержит данные и ссылку на следующий или предыдущий узел в списке.
 *
 * В целом, выбор между LinkedList и ArrayList зависит от конкретной задачи и требований к производительности.
 * Если требуется частый доступ к элементам по индексу, то лучше использовать ArrayList.
 * Если же требуется частое добавление или удаление элементов в середине списка, то лучше использовать LinkedList.
 */
public class LinkedList {
}
